# Шпаргалка по Git'у

## Основные команды

* *git init* - создание нового репозитория (создается скрытый файл с расширением .git)

* *git status* - показ состояния файлов в рабочей дирректории

* *git add "название файла"* - добавление файла в комит

* *git commit -m"причина изменений"* - закомитить (сохранить) добавленные файлы с сообщением об изменениях, делается после git add

* *git log* - список комитов

* *git checkout* - переход к предыдущим версиям (указать 4 символа из log)

* *git checkout master* - возврат на самую актуальную версию

* *git diff* - разница между двумя коммитами (через пробел указать 4 символа из log двух комитов)

* *ctrl+s* - не забывай сохранить изменения перед тем, как делать git add

## Работа с ветками

* *git branch* - вывод всех веток, (*) указывает на ту ветку, на которой мы находимся.

### Создание ветки

* *git branch (название ветки)* - создание новой ветки

* *git branch -d(название ветки)* - удаление ветки, которую мы слили.

### Переход между ветками

* *git checkout (название ветки)* - переход между ветками

### Список коммитов по веткам

* *git log --graph* - список коммитов по веткам

### Слияние веток

* *git merge (название ветки)* - слияние веток. Команда вызывается из той ветки, куда необходимо добавить изменения.
